# SaveActiveDocument

## Description
Saves a file with out presenting dialogs

```pascal
FUNCTION SaveActiveDocument(filePath : DYNARRAY[] of CHAR) : LONGINT;
```

```python

def vs.SaveActiveDocument(filePath):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filePath|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2014
## Category
* File I/O